{
  "total_comments": 256,
  "comments": [
    {
      "video_title": "The Most Underrated Muscle for Looking Jacked (And How to Build It)",
      "text": "Good stuff, appreciate your videos! However I don't think the wrist roller trains the opposite muscles (wrist extension in your example) on the way down, since your resistance is still in the same direction; the only difference is that on the way down it's resisting the weight falling down instead of bringing it up. It's just like the eccentric of a push up, which doesn't make it a pull exercise; it still uses the same muscles as the concentric. To turn the wrist roller into a wrist extension exercise you have to turn it around, so that the band hangs from the other side of the bar. Right?\n\nI also like to train wrist radial and ulnar deviation (with a stick with weight on one end) as well as wrist pronation and supination (with something like a judo belt with weight plates hanging from it) and dumbbell finger rolls. As a climber I feel like this could help a lot in injury prevention.",
      "author": "@kewner8556",
      "likes": 2
    },
    {
      "video_title": "The Most Underrated Muscle for Looking Jacked (And How to Build It)",
      "text": "personally for me the neck/traps are very underrated as well! Loving the content man and thx for simplifying the youtube fitness space for us fellas 💪",
      "author": "@Rakyr",
      "likes": 19
    },
    {
      "video_title": "The Most Underrated Muscle for Looking Jacked (And How to Build It)",
      "text": "Amazing stuff man, I do have a question though. Do you do any body weight stuff during the week? Like 50 push ups every morning, etc? Or just the lifts? Should your chest be so sore you can't do push ups througout the week? Becuase if im hitting chest once a week hard (which I agree with) is it gonna hurt to add some body weight just to have something to do exercise wise during the week to help me wake up / stimulate my muscles? Hopefully that makes sense! This question could also apply to things like body weight squats, arm curls, etc. Movements that people have historically added to their daily routine.",
      "author": "@DadsReadAlongStories",
      "likes": 0
    },
    {
      "video_title": "The Most Underrated Muscle for Looking Jacked (And How to Build It)",
      "text": "I like neck is underrated in my opinion they are also visible an most people don't train it because if they saw somebody doing a neck exercises it looks werid but your neck is used to keep your spine and head stable and strong. Neck can one of the most injury prone areas in my opinion.",
      "author": "@joelthesupergamerboy8427",
      "likes": 2
    },
    {
      "video_title": "The Most Underrated Muscle for Looking Jacked (And How to Build It)",
      "text": "Every time a start to make progress a get inner elbow injury.... both sides, second tim it happens now....pisses me of, takes long time to recover.",
      "author": "@supportfairing",
      "likes": 0
    },
    {
      "video_title": "The Most Underrated Muscle for Looking Jacked (And How to Build It)",
      "text": "I bought your program the other day. Thanks for providing the necessary information and breaking down everything. Can't wait for the results in the coming months",
      "author": "@D617_",
      "likes": 0
    },
    {
      "video_title": "The Most Underrated Muscle for Looking Jacked (And How to Build It)",
      "text": "Posted 15 mins ago, and already I’m further enlightened",
      "author": "@adamkhan838",
      "likes": 7
    },
    {
      "video_title": "The Most Underrated Muscle for Looking Jacked (And How to Build It)",
      "text": "Could you clarify again how you program the forearm roller?",
      "author": "@jakewboyle",
      "likes": 0
    },
    {
      "video_title": "The Most Underrated Muscle for Looking Jacked (And How to Build It)",
      "text": "im on my weight loss journey and one thing that i didnt expect is how much smaller my forearms will become so now im hitting them harder to grow back to og size but yeah smaller forearms make the physique look weaker automatically",
      "author": "@Humble9000",
      "likes": 1
    },
    {
      "video_title": "The Most Underrated Muscle for Looking Jacked (And How to Build It)",
      "text": "Bro HOW are you this lean year round? You must have crazy good diet and hormone balance",
      "author": "@S1mpleThings",
      "likes": 0
    },
    {
      "video_title": "The Most Underrated Muscle for Looking Jacked (And How to Build It)",
      "text": "1:43 What about using a straight bar for wrist curls? I heard cables also provide constant tension and are efficient.",
      "author": "@Skillz69420-x",
      "likes": 0
    },
    {
      "video_title": "The Most Underrated Muscle for Looking Jacked (And How to Build It)",
      "text": "I do wrist curl with a bar so i dont need to fail twice",
      "author": "@mayantheman",
      "likes": 0
    },
    {
      "video_title": "The Most Underrated Muscle for Looking Jacked (And How to Build It)",
      "text": "My absolute weak point that limits me in deadlifts and lat pulldowns for example. Never used straps and never will, instead I am working on my deadhangs.",
      "author": "@KaliumhexacyanoferratIII",
      "likes": 1
    },
    {
      "video_title": "The Most Underrated Muscle for Looking Jacked (And How to Build It)",
      "text": "Yessss, finally a video about my weak point 💪🏻🩶🤍",
      "author": "@fahiim_x",
      "likes": 4
    },
    {
      "video_title": "The Most Underrated Muscle for Looking Jacked (And How to Build It)",
      "text": "Clean and on point video dude! btw what's your opinion on weighted calisthenics (dips, pull ups, deep push ups) ?",
      "author": "@Doxymiro",
      "likes": 0
    },
    {
      "video_title": "The Most Underrated Muscle for Looking Jacked (And How to Build It)",
      "text": "My skinny ahh lanky forearms finally started to grow when I added regular hammer curls to my arm workout.\n\nThe brachioradialis activation is remarkable with this exercise.",
      "author": "@lippi2171",
      "likes": 0
    },
    {
      "video_title": "The Most Underrated Muscle for Looking Jacked (And How to Build It)",
      "text": "Finally, FOREARMS!! Thank you man!! I will for sure use this in my training as I still have (relatively) skinny forearms... Merry Christmas!!",
      "author": "@matteocasotto8008",
      "likes": 1
    },
    {
      "video_title": "The Most Underrated Muscle for Looking Jacked (And How to Build It)",
      "text": "Should I lower my sets for accessories from 3 to 2 to fit these into my upper workouts?",
      "author": "@henrycornwell1383",
      "likes": 0
    },
    {
      "video_title": "The Most Underrated Muscle for Looking Jacked (And How to Build It)",
      "text": "How should we incorporate this into the new 2026 routine?  Is this an add-on?",
      "author": "@CyGainz3",
      "likes": 0
    },
    {
      "video_title": "This Is the Workout Program I’d Use to Get Jacked in 2026",
      "text": "Sleep is the one thing I need to work on.",
      "author": "@seekertosecrets7618",
      "likes": 35
    },
    {
      "video_title": "This Is the Workout Program I’d Use to Get Jacked in 2026",
      "text": "You know what the worst part of this is?\nYou are correct.\n\nIve been training and checking what i eat for about more than a month now. Before that i started walking and some cardio.\nIm slowly getting stronger and slowly lose fat but also gain muscle.\nCan do a full set of pushups now and probably can do my first pullup soon too.\nThis was impossible for me before i started. I didnt exercise at all.\n\nConsistency just works, but it is slow. And if things slow down, i probably only need to change something small and continue.\nYou know what sucks most about this? There is no magic. \n\nNo special thing that makes this faster (without extreme drawbacks).\nNo \"hack\" that makes it easier.\nNo Supplement that makes this effortless.\n\nThere is no shortcut. \"Keep it simple stupid\". \nFrom my experience, which isnt too much yet but still,\nstart with something. Even \"just\" walking will do a lot for you. And then slowly add more to it over time.",
      "author": "@Jadenyoung1",
      "likes": 0
    },
    {
      "video_title": "This Is the Workout Program I’d Use to Get Jacked in 2026",
      "text": "Hey awesome video, my only question is how many sets should I do? I've been doing 2 sets to failure on every exercise for a while now, but should I do more sets for compounds and less sets for isolation? For example, 4 sets of bench press and 2 set of lateral raises. Or am I overthinking and 2 sets for every exercise is totally fine as long as each one is pushed to failure. I have this concept in my mind that spamming sets on isolation exercises is pointless, but doing more sets on compound lifts is worth it because of the additional muscles being activated. Thanks anyway, very helpful video.",
      "author": "@32ducky",
      "likes": 0
    },
    {
      "video_title": "This Is the Workout Program I’d Use to Get Jacked in 2026",
      "text": "i am the perfect subject for this plan. i am single and work a full time job. i want to be healthy and look healthy/fit. but i dont want to go 6x a week. going to start this plan 3x a week. maybe 4 if i get in the groove. i need to shred 15-20 lbs. ive lost it before but it slowly creeps back up so i know i can lock the diet in. i will also mix in some carido since i am trying to lose weight. thanks and wish me luck. so sick of being average and lacking the confidence i deserve to have",
      "author": "@jimlaheylovesrandy",
      "likes": 1
    },
    {
      "video_title": "This Is the Workout Program I’d Use to Get Jacked in 2026",
      "text": "One guy told me to go to failure on ever set, I can’t understand how to track progress like that. Like if I’m doing 18 on the first set but then get 5 or 6 on the next two how do I know when to up the weight? I just do the 8-12 and when I get 12 on each set I up the weight but everyone keeps saying “go to failure” so it makes me question if I’m doing it right",
      "author": "@Mike2trys",
      "likes": 0
    },
    {
      "video_title": "This Is the Workout Program I’d Use to Get Jacked in 2026",
      "text": "I love these videos, they feel so against what Ive always thought but also great for where i am in life. Im 41 years old, I’m 6’5” and 205lbs. The ease of this workout i like as i also do shift work. Only question is my legs are one area where id love them to grow, would the UL split do that hitting legs once a week? Would a 3 day full body be more beneficial? Many thanks for all your help and brilliant no BS content too",
      "author": "@itsgaz8515",
      "likes": 0
    },
    {
      "video_title": "This Is the Workout Program I’d Use to Get Jacked in 2026",
      "text": "So just to follow up, bought the jacked workout notebook (and the gf loved it and was already thinking about buying a similar one) score. Second thing, it will be interesting for me to see how many calories I have to consume per day to be able to grow. It’s never seemed to matter how many I did for the past few years, I’ve stayed the same weight since junior high. F, 5’10”, 125lbs. Looking forward to the new year and finding your yt channel! Happy holidays",
      "author": "@draagron_6573",
      "likes": 0
    },
    {
      "video_title": "This Is the Workout Program I’d Use to Get Jacked in 2026",
      "text": "My biggest issues since this past year has been not doing progressive overloading until about a month ago. I been doing the same lifts (with variations and occasionally swapping to mix things up) at the same weight. I’ve been lifting on and off for a few years and now I’m kicking myself in the butt for not overloading as I should’ve. I completely undermined my strength and now I truly see myself getting stronger.",
      "author": "@iOnyxOnyx",
      "likes": 0
    },
    {
      "video_title": "This Is the Workout Program I’d Use to Get Jacked in 2026",
      "text": "I did the typical bro split for the whole year 2025, im not that jacked, about 5'8 155-160 pounds lean. I did my first upper split -two push movement, two pull movements, one shoulder movement, one tricep and one bicep and I totally understand why people ask if this is enough volume. I feel like I got a good workout in but cant shake the feeling If I did enough.",
      "author": "@thegalaticskytrader665",
      "likes": 0
    },
    {
      "video_title": "This Is the Workout Program I’d Use to Get Jacked in 2026",
      "text": "I've noticed you slowed down adding more to your atj course. I really like your course. straight to the point with no fluff but it seems like the content roadmap (planned for 2025) has not changed in months. will 2026 change that? great content. love your work.",
      "author": "@philippebigras5039",
      "likes": 0
    },
    {
      "video_title": "This Is the Workout Program I’d Use to Get Jacked in 2026",
      "text": "What about push pull legs? Thats what I’ve been doing for the last 6 months and I’ve been training just over a year. \nI don’t train legs enough and my diet and core need more effort. That’s the plan for the new year.",
      "author": "@mikey22355",
      "likes": 0
    },
    {
      "video_title": "This Is the Workout Program I’d Use to Get Jacked in 2026",
      "text": "this is what I do\n\nU U L U U L L (weekends bodyweight focus and rest)\nsome Upper days I would deload but still do something (calesthenics, abs etc.)\nBut i ve found out I start the day much better by doing something every day... \n\nMy workouts are around 45 min and on the days I take longer and go slower recovery is better.\n\nThanks for the advice, I am still finding it tough to deload...",
      "author": "@polombo1",
      "likes": 0
    },
    {
      "video_title": "This Is the Workout Program I’d Use to Get Jacked in 2026",
      "text": "I’ve been doing Mike mentzers style of workout and yours sound similar . Guys if you’ve had or still have some sort of autoimmune disease, you actually need to train this way!!! Max 3 times a week not more as your body is already inflamed and only causes more stress if you workout more!!! I’ve had hashimotos if you’re interested how I healed let me know.",
      "author": "@kamilmusalat",
      "likes": 0
    },
    {
      "video_title": "This Is the Workout Program I’d Use to Get Jacked in 2026",
      "text": "M your new sub from Delhi India. Thanks for motivating people across the globe. This was heck of motivation. M ready for 2026 jacked me. 😊 and the example you used 2:50 was just awesome and made sense.",
      "author": "@ivanswarovski4811",
      "likes": 0
    },
    {
      "video_title": "This Is the Workout Program I’d Use to Get Jacked in 2026",
      "text": "One question I have is, you said to do example of 3 sets of 6 then increase weight but you said you should be almost to failure after each set. If I’m doing the same weight each set the first set I can’t go to failure and get 6 each set",
      "author": "@jdaslfjdl5435",
      "likes": 0
    },
    {
      "video_title": "This Is the Workout Program I’d Use to Get Jacked in 2026",
      "text": "For Upper Day\n\nIncline Chest Press\nIncline Machine Press\nLat Pulldown\nCable Row\nLat Raises\nTricep Pushdowns\nBicep Curls\n\nDoes this look good to you? Would you add chest fly machine instead of one of the exercises?",
      "author": "@jordand2103",
      "likes": 0
    },
    {
      "video_title": "This Is the Workout Program I’d Use to Get Jacked in 2026",
      "text": "Hi nice video, im 3 months into training and was doing 3x full body per week. Should I switch to ULU ?",
      "author": "@seigward_jenkins2237",
      "likes": 0
    },
    {
      "video_title": "This Is the Workout Program I’d Use to Get Jacked in 2026",
      "text": "When you say next workout for the sets and reps, you mean in the next day of doing the exercises right? Sorry Eric just overthinking and my comprehension is a little bad sometimes lol",
      "author": "@katjun573",
      "likes": 0
    },
    {
      "video_title": "This Is the Workout Program I’d Use to Get Jacked in 2026",
      "text": "I just want to make things clear do you train the same mucsle twice a week with Upper Days or do you split your exercises over those 2 days training different muscle groups?",
      "author": "@youtube_fan_boy",
      "likes": 0
    },
    {
      "video_title": "This Is the Workout Program I’d Use to Get Jacked in 2026",
      "text": "\"Instant gratification takes too long.\" \nThe late Carrie Fisher.",
      "author": "@warrenenglish942",
      "likes": 4
    },
    {
      "video_title": "This Is the Workout Program I’d Use to Get Jacked in 2026",
      "text": "I need your guy's advice\nHow many sets per exercise do you think I should do when I follow this plan?\nI'm still in beginner early intermediate stage.\nPlease let me know your thoughts",
      "author": "@omkarkhurana6986",
      "likes": 0
    },
    {
      "video_title": "This Is the Workout Program I’d Use to Get Jacked in 2026",
      "text": "I'm a beginner (only 2 months in) and I feel like this is exactly the kind of advice I need. Gives me hope that I can get stronger and build muscle without working out constantly!",
      "author": "@garyrochussen3430",
      "likes": 0
    },
    {
      "video_title": "This Is the Workout Program I’d Use to Get Jacked in 2026",
      "text": "1:05 Bro is incognito lifting",
      "author": "@marcuso2006",
      "likes": 5
    },
    {
      "video_title": "This Is the Workout Program I’d Use to Get Jacked in 2026",
      "text": "I would like mire info with the fat recomp mentioned. Ive been told i need insulin resistance reset and need to shred all my fat  before i can build good muscle and not store fat anymore and it corrects my metabolic disorder.",
      "author": "@juanherrera2672",
      "likes": 0
    },
    {
      "video_title": "This Is the Workout Program I’d Use to Get Jacked in 2026",
      "text": "Thank you I will stick to this plan for the next 12 months",
      "author": "@Leon-Mauirce",
      "likes": 0
    },
    {
      "video_title": "This Is the Workout Program I’d Use to Get Jacked in 2026",
      "text": "How are you not a bodybuilder?",
      "author": "@alexandruradudragos1434",
      "likes": 1
    },
    {
      "video_title": "This Is the Workout Program I’d Use to Get Jacked in 2026",
      "text": "This is exactly what I'm looking for, a sustainable and easy to follow routine that I can stick to daily. Thank you for keeping it real and I really appreciate the value you provide in your videos!",
      "author": "@peticount",
      "likes": 0
    },
    {
      "video_title": "This Is the Workout Program I’d Use to Get Jacked in 2026",
      "text": "Im happy I already have one of these rules down. I walk between 15-20 miles per week as an RN lol. Really helps keep me lean when I dont have enough time to gym 4-5 days like I used to.",
      "author": "@_JB89",
      "likes": 0
    },
    {
      "video_title": "This Is the Workout Program I’d Use to Get Jacked in 2026",
      "text": "would overhead press be counted as a press or a shoulder movement?",
      "author": "@fleshboundtobone",
      "likes": 0
    },
    {
      "video_title": "This Is the Workout Program I’d Use to Get Jacked in 2026",
      "text": "Will this work with a push pull leg + a fourth day for abs and forearms? once a week?",
      "author": "@Mark-ne4hd",
      "likes": 0
    },
    {
      "video_title": "My S-Tier Exercises for Getting Jacked",
      "text": "My brothers and sisters... Working out has been so overcomplicated by social media. Although its not necessarily easy, It's actually very simple to put on muscle. Stick to the basics. Great vid for the newcomers btw.",
      "author": "@Jonnyhere",
      "likes": 3
    },
    {
      "video_title": "My S-Tier Exercises for Getting Jacked",
      "text": "I recently started my fitness journey on a serious note. And I was so happy to see most of the workouts I do matched what you suggested. And m more motivated after watching your video. You explained it in very simple and easy way and were very polite and sounded like a gentleman. Thanks so much. ❤❤ Hello from New Delhi , India. And the key take away for me is to stay consistent. thanks again.",
      "author": "@ivanswarovski4811",
      "likes": 0
    },
    {
      "video_title": "My S-Tier Exercises for Getting Jacked",
      "text": "instead of incline dumbell flies, i prefers doing incline cable flies. it feels super comfortable on my shoulder, without any pain but just enough stress on my chest muscles.",
      "author": "@astrrofn5107",
      "likes": 0
    },
    {
      "video_title": "My S-Tier Exercises for Getting Jacked",
      "text": "4:10 made me happy! I do that same form leaning back, while the legs look weak barely supporting this movement. lol I never see anybody else do it like this beside me",
      "author": "@mattursua2546",
      "likes": 0
    },
    {
      "video_title": "My S-Tier Exercises for Getting Jacked",
      "text": "I only do three days each week at the gym 1. Arms 2. Seated low row and chest press 3. Leg press. And I do the plank everyday before bed. That seems to work really well for me and targets my whole body 😊 I’m seeing really good results with this gym plan.",
      "author": "@jameswarden9136",
      "likes": 1
    },
    {
      "video_title": "My S-Tier Exercises for Getting Jacked",
      "text": "Awesome pics. Great size. Look thick. Solid. Tight. Keep us all posted on your continued progress with any new progress pics or vid clips. Show us what you got man. Wanna see how freakin' huge, solid, thick and tight you can get. Thanks for the motivation.",
      "author": "@ghlibisk67",
      "likes": 0
    },
    {
      "video_title": "My S-Tier Exercises for Getting Jacked",
      "text": "Quick question: on upper days should I do chest exercises back to back then back exercises back to back? Or split them up so I do one chest exercise, then one back exercises, etc",
      "author": "@gberky",
      "likes": 0
    },
    {
      "video_title": "My S-Tier Exercises for Getting Jacked",
      "text": "Hi, I’m a little confused. Your workout plans include more and different exercises, but in this video you say it only takes a few.",
      "author": "@MarcusInd3p3ndence",
      "likes": 0
    },
    {
      "video_title": "My S-Tier Exercises for Getting Jacked",
      "text": "its great to see my mindset match 100% to yours and seeing i have been training for about 1 and a half years now i know i have no excuses to not get jacked",
      "author": "@Blendette",
      "likes": 0
    },
    {
      "video_title": "My S-Tier Exercises for Getting Jacked",
      "text": "Found out I was pretty much doing this full workout already and found out in 7 minutes why it's good and why it's working. \n\nAbsolutely cut all the extra noise around it out of the video. \n \nSubscribed then and there. \nA well earned sub. I wish everything was this easy to understand",
      "author": "@themightychippy3756",
      "likes": 0
    },
    {
      "video_title": "My S-Tier Exercises for Getting Jacked",
      "text": "Straight bar is so bad it hurts my wrist personally.",
      "author": "@ethancbaker2002",
      "likes": 0
    },
    {
      "video_title": "My S-Tier Exercises for Getting Jacked",
      "text": "Do you find too much pressure on the chest and ribs during chest support tbar rows? Kinda uncomfortable but I still do them sometimes",
      "author": "@danejdevos",
      "likes": 0
    },
    {
      "video_title": "My S-Tier Exercises for Getting Jacked",
      "text": "What does my free testosterone need to be at to see results from my workouts?  Above 5.1 ng/dL?  Above 0.5 nmol/L?",
      "author": "@bwfrieds",
      "likes": 0
    },
    {
      "video_title": "My S-Tier Exercises for Getting Jacked",
      "text": "S tier - Diet and consistency.",
      "author": "@ericpadilla2454",
      "likes": 4
    },
    {
      "video_title": "My S-Tier Exercises for Getting Jacked",
      "text": "Can I ask you a question? How many sets of these do you do—incline dumbbell presses(etc)?",
      "author": "@szubacs",
      "likes": 1
    },
    {
      "video_title": "My S-Tier Exercises for Getting Jacked",
      "text": "no glute work, great work on teaching people to get injured and have knee problems later in life",
      "author": "@fraserpye9667",
      "likes": 0
    },
    {
      "video_title": "My S-Tier Exercises for Getting Jacked",
      "text": "I wish my gym had the incline chest fly machine, it looks great. best alternative i found for it was using a incline bench and putting it between two cable flys. worked wonders for my upper chest!",
      "author": "@anthonysane",
      "likes": 0
    },
    {
      "video_title": "My S-Tier Exercises for Getting Jacked",
      "text": "No preacher curls no baysien curls, are these help or just incline curls are best?",
      "author": "@viratsingh9600",
      "likes": 0
    },
    {
      "video_title": "My S-Tier Exercises for Getting Jacked",
      "text": "hardly disagree with incline (or any other) dumbbell fly. it has 0 resistance at the top part of the exercise in the direction that you want.  any kind of cable-based fly is superior over dumbbells",
      "author": "@justas3000",
      "likes": 0
    },
    {
      "video_title": "My S-Tier Exercises for Getting Jacked",
      "text": "Any tips on growing the traps? Mainly the upper part?",
      "author": "@light6069",
      "likes": 0
    },
    {
      "video_title": "My S-Tier Exercises for Getting Jacked",
      "text": "Probably the best video of ranking S tier exercises brother I've been doing all the exercises you've mentioned and it works and the most effective yet also best way to get jacked .❤",
      "author": "@Ashutosh-1101",
      "likes": 0
    },
    {
      "video_title": "My S-Tier Exercises for Getting Jacked",
      "text": "Pretty close to my S-Tier list, and a lot of these selections were to protect/strengthen against injuries that a lot of popular lifts don't address. Nice!",
      "author": "@GearHeart_22",
      "likes": 0
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "I started training in 1978 when I was 14. Two years before that, I threw out my back shanking a punt during football—ended up with spondylolisthesis in my L5-S1. Doctors told me not to lift, said it would make it worse. My back was so unreliable I’d often sit out gym class, until an 8th grade teacher warned me I wouldn’t get away with that in high school.\n\nEverything changed when my youth football coach’s son took me down to their basement and showed me his barbell set. I tried a bench press, then a curl—95 lbs. on each, sloppy as hell, but I got them up. I was hooked. Got my own barbell set the following Christmas.\n\nMy goal wasn’t to get big—it was to get strong. All I had to go by was the wall chart that came with my 110 lb. Diversified Products set from Sears (where my dad worked) -- cement inside with a plastic coating.  I followed it religiously. And I got strong—even more once I got an adjustable bench w/leg extension the next year.\n\nBut something else happened. I hit my growth spurt hard. Between freshman and sophomore year, I went from 108 lbs. to 162 lbs. People noticed. Friends asked about my bench, teachers told me I looked good. That’s when I got serious—books, a chin-up bar in my doorway,  learning about diet. The muscle came as a byproduct of getting stronger.\n\nI never looked back. Never had interest in stepping on a bodybuilding stage—not even once. But I did turn it into a career as a pro wrestler. That strength paid off in other ways too, like working as a land surveyor and being able to remove 230 lb. manhole covers by myself, one-handed.\n\nEventually, you realize you can only grow so much. The rest of the journey is about holding onto what you’ve built—and fighting like hell not to lose it.",
      "author": "@firebird7479",
      "likes": 1
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "I don't know man, the body shown as a proof of being \"skinny beginner\" is pretty much all I'd ever need.",
      "author": "@AnssiEriksson",
      "likes": 19
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "I agree. I decided to change my workout plan based on the time I have available.\n\nUpper Day 1(Chest and Back Focused): 3 Back Exercises(3 sets each), 2 chest exercises(3 sets each), 1 bicep(2 sets) and 1 tricep(2 sets) exercise. Max Time taken 45-50 Minutes.\n\nLegs + Shoulders 1: 2 Quad Movements, 3 shoulder movements, 1 hamstring movement and 1 calf movement+3 Sets of Hammer Curls(50 Minutes to 1 hour depending on my rest time)\n\nRest Day\n\nUpper Day 2(Bicep and Tricep focused): 2 Biceps Exercises(3 sets each), 2 triceps exercises(3 sets each), 1 chest exercise(2 sets), 2 back exercises(2 sets)(45-50 Minutes total again)\n\nLegs+Shoulders 2: Same as the first one.\n\n4 days a week with 3 rest days. Have been managing extremely well and it doesn't feel like I'm missing out. High Intensity too.\n\nWhat is your personal opinion on this?",
      "author": "@radicaldrake7064",
      "likes": 2
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "Working out is literally just discipline and patience. \n\nMost people lack the two, and that's why they're always frustrated. \n\nWant the results you desire? Do the same thing literally every single day, without fail, and you'll see results over time. PPL 6 days/week, 7-8 hours of sleep daily, eat the same food every day. No ifs ands or buts.",
      "author": "@SntYvsLrnt",
      "likes": 0
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "Bro it's been 5 months since I am going gym,  I have been following push pull legs all these months now I switched to Arnold split .I was fat and in these months I significantly lost weight, I look much leaner now but I am really not sure if my muscles are growing or not. So my questions are ,am I a beginner and what should I do to get more hypertrophy?",
      "author": "@ABHIJEETKAMBLE-r8g",
      "likes": 0
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "Hey, Really nice video, I was really self-doubting at first and after watching, the point is just to get your nutritions right and sleep well, Also consistency.\nI’m 175cm and 75 kilos Right now,\nShould I bulk or get leaner?\nIt’s mostly fat and some muscle.\nKeep up the good work, Love the videos, Subbed.🎉",
      "author": "@xyrity",
      "likes": 2
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "Hey, Eric. A video on rest periods between sets specifically might be an interesting topic that you haven't covered. Just a thought! Many different opinions out there.",
      "author": "@barbellbryce",
      "likes": 7
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "My current program consists of two upper days and one lower day, where each upper day has 7 exercises with 3 sets each all to failure. Any thoughts?",
      "author": "@yassinehajou1336",
      "likes": 0
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "\"I was a skinny guy\" (with a popping sixpack, great muscle form and clearly superior genetics). Fixed that for you 😅\n\nYour content is still good, but fitness influencers are self-selected success stories. Look up Richard Simmons -- he's literally the only fitness guy I've ever seen with average genetics.\n\nNot casting stones: I'm luckier than most -- but not as gifted as you 💀",
      "author": "@askingwhy123",
      "likes": 0
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "Wow I like your philosophy, but wonder if you gained a great base of muscle then discovered your workout program. If you developed a good base of muscle lifting in a more traditional way it may be easier to maintain it with your program. Just wondering.",
      "author": "@RobertSzabo-f6i",
      "likes": 0
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "My height is 5'7\" which is 67 (!!!) Inches. Which meas my ideal jacked weight is anywhere from 160 to 170 pounds, which is absolutely accurate because I'm 180 and still look relatively lean (after 2 years of lifting)",
      "author": "@PaulART-d8x",
      "likes": 0
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "Mf you werent a skinny kid you were a jacked kid",
      "author": "@julianpermuy8191",
      "likes": 6
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "I watched way too many videos on programs and blah blah blah and honestly, I had the best results going on ChatGPT and just asking for it to make me a good push pull leg program 4-5 days week and it kept it simple and amazing.",
      "author": "@IowaRetroGamerDad",
      "likes": 0
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "im 175cm tall and 100kg, this is my call to start a cut.",
      "author": "@spudius1337",
      "likes": 5
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "As someone training for 8+ years and 155 pound lean that equation hurt 😂",
      "author": "@Fittothebone",
      "likes": 0
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "What if I'm 5'11\" 195, muscular and lean, but as weak as a beginner at the big compound lifts? Should I try to  gain weight and actually get strong or just maintain weight and get a little more jacked?",
      "author": "@mrbork5409",
      "likes": 0
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "Thanks bro. I never think I’ve done enough then start to do more and more just get burnt out instead of just being consistent. I always judge a workout based on if I’m sore the day after as well. If I’m not sore I didnt go hard enough.",
      "author": "@yahmean4730",
      "likes": 2
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "I have been doing high intensity training for about 2 months and have had the best gains I've ever had. It's actually working so good that I have to resist the urge to keep adding more and more.",
      "author": "@jaketaz2848",
      "likes": 1
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "I'm 6 years in and fighting the urge to start test cycle, I don't want to but I just at 38 have had enough of not being totally happy with my physical appearance yet, please discourage me not to",
      "author": "@michaelbradley2702",
      "likes": 0
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "Nobody wants to hear that this shit takes years of work. Probably over a decade for a natty before people even notice you train.",
      "author": "@geneharrogate6911",
      "likes": 1
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "Hello sir,\nHow are you?\nDo you want a professional YouTube Thumbnail designer?\n\nLet me know please \nThanks.",
      "author": "@smsadirul3",
      "likes": 0
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "ATJ videos are straight to the point no BS this is the future fitness content thank you for these videos king",
      "author": "@Barryftw",
      "likes": 2
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "This is true. Appreciate the info. Every now and then I start to want to change up but I have seen the most progress in strength following the same plan.",
      "author": "@southwindz7",
      "likes": 1
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "Keep going!\nLove that you give advice apart from the fitness mainstream.\nTelling what really helps. 💪",
      "author": "@s0nofg0d2",
      "likes": 2
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "Hi Eric,\nare you still following your Mike Mentzer style split?",
      "author": "@EwanRussell_1",
      "likes": 0
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "Stay the course Brothers and Sisters , this is the way .",
      "author": "@RyanDawson-d3n",
      "likes": 0
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "By the way, your body type is already above what is considered attractive, at least by women. Most women prefer a body that you showed when you were young, its that brad pitt troy-ish type of body.",
      "author": "@don_kandon6006",
      "likes": 0
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "i have an issue while using dumbell for presses, the issue is i cant make them stay in one place during pressing they tend to drift back while pressing how to fix this",
      "author": "@BeingBetterX",
      "likes": 0
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "is hitting every muscle group twice per week not necessary???\nhow can it be done in 3/4 days",
      "author": "@niqqa_balls.f2p",
      "likes": 0
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "Do you have experience with shoulder pain brother",
      "author": "@Elysium90",
      "likes": 0
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "That formula is a good tip!",
      "author": "@antoniodangelo88",
      "likes": 3
    },
    {
      "video_title": "Is Your Workout Actually Enough to Build Muscle?",
      "text": "Actually Mike Mentzer said to do the negative in 4 seconds and hold the maximum contraction for a few seconds before starting the negative",
      "author": "@Mefis56",
      "likes": 1
    },
    {
      "video_title": "I’ve Done 1,500 Workouts. This One Thing Matters Most For Getting Jacked",
      "text": "Intuitive training is good; it depends on your experience. You can always progress, especially if you train to failure. If your sets are hard enough, you don’t need to track every weight, but noting your main lifts once a month is a good way to check if you’re truly progressing.\n\nMuscles don’t see numbers—they respond to hard work and progressive overload. Tracking can make linear progression easier, but if you push all sets to failure, your body will naturally adapt and you’ll increase weight intuitively over time.\n\nBad intuitive training is what you described in the video: training comfortably, constantly changing exercises, chasing pump. That leads to minimal gains.\n\nGood intuitive training, on the other hand, is hard, structured, and consistent. If you listen to your body, train hard, and track main lifts occasionally, you don’t need to log every set.\n\nTracking everything can be useful, especially for beginners, but the key is finding the right approach for yourself. Some people thrive on high volume, some on lower volume. Some succeed purely intuitively, others with detailed tracking. There is no universal optimal method.\n\nTraining smart and hard is the universal key to your dream body.\n\nI’d love to hear your opinion on this because I’m always learning and could be wrong. Love your channel—it helps people stop wasting time in the gym and start training really hard instead of just long.\n\nTake care, brother!",
      "author": "@AdmandGaming",
      "likes": 2
    },
    {
      "video_title": "I’ve Done 1,500 Workouts. This One Thing Matters Most For Getting Jacked",
      "text": "A common problem in assessing progress is switching around the workouts so often that it becomes impossible to know whether or not you're getting stronger. And make no mistake, STRENGTH is the goal. Judging progress based on body weight will only incentivize weight gain. But the rate of muscle growth is too slow to be useful here. If you are getting measurably stronger on each workout (or nearly so), then muscle growth WILL follow. Now, once you're focused on getting more reps with more weight, then a second common problem arises. You must perform the same exercises for an extend period as mentioned previously, but YOU ALSO MUST maintain the same form and rep cadence. If you are going slow, smooth, and strict one week, but you up the weight and start slinging the weight to get your reps, then are you getting stronger? PROBABLY NOT. You have to keep all the parameters constant in order to assess progress. The only things that should change are the # reps and resistance used. This is how you KNOW you are making progress. \"The first principle is that you must not fool yourself - and you are the easiest person to fool.\" Richard Feynman",
      "author": "@MarcosBuenijo1973",
      "likes": 0
    },
    {
      "video_title": "I’ve Done 1,500 Workouts. This One Thing Matters Most For Getting Jacked",
      "text": "I’ve been skinny for years, and before that I was extremely overweight in my teens. I lost weight, but it came with years of an eating disorder, which eventually put me in the hospital because I became dangerously skinny.\n\nOver the past year, I’ve been going to the gym, but more recently I found your videos. I actually log my workouts now, watched your 180-day video, and follow a lot from it. I also keep track of your other videos and apply them to my training. I’ve been doing this consistently for four months.\n\nI see so many changes in the mirror my glutes, biceps, a V-line—and I don’t look so skinny anymore. I don’t look “jacked,” but I look like I go to the gym, which for me means everything. I don’t want to get big like a bodybuilder. My goal is simply to look at myself and love who I see.\n\nI still have a long road ahead, but I just want to say thank you. I feel happier, I’ve been going to the gym 3–4 times a week for a year and two months, and I’m now 8 months sober from my eating disorder.\n So Thank you",
      "author": "@RafieTV",
      "likes": 0
    },
    {
      "video_title": "I’ve Done 1,500 Workouts. This One Thing Matters Most For Getting Jacked",
      "text": "I’ve seen huge improvements since I started tracking my workouts with Dietornia-lost 10lbs in 3 weeks!",
      "author": "@ashfaqashfuu",
      "likes": 20
    },
    {
      "video_title": "I’ve Done 1,500 Workouts. This One Thing Matters Most For Getting Jacked",
      "text": "Been using Dietornia to log my workouts, and it’s made it so much easier to see my gains.",
      "author": "@bapunbapun3235",
      "likes": 18
    },
    {
      "video_title": "I’ve Done 1,500 Workouts. This One Thing Matters Most For Getting Jacked",
      "text": "Tracking my workouts with Dietornia has helped me gain 13.5lbs of muscle in just 5 weeks!",
      "author": "@cartoon-aih",
      "likes": 18
    },
    {
      "video_title": "I’ve Done 1,500 Workouts. This One Thing Matters Most For Getting Jacked",
      "text": "I find it so Hard to level on the squats.. I actually went back a few weights, just to control the form, and do a little more reps.\n\nThe pull-ups is the same.. gain like 1 rep in two years, from 10 to 11.\n\nAlso the dumbell press. Just stuck at the same weight with 5-7 reps.\n\nEdit: I might have fluctuated around my weight, with 1-4 kg body weight back and forth. Obviously I feel stronger when +4kg than staying -4kg at my usual weight.",
      "author": "@marcuso2006",
      "likes": 0
    },
    {
      "video_title": "I’ve Done 1,500 Workouts. This One Thing Matters Most For Getting Jacked",
      "text": "Great video as always.\nI am training consistently for 2 years now, upper lower, but find it hard to add more reps each week.\nUsually from like the 8 different exercises I will do in a day I can add a rep to maybe 2? I also try to take every set to failure as best as I can.\n\nPlease help me out!\n\n🙏",
      "author": "@angelbaybungalows5295",
      "likes": 0
    },
    {
      "video_title": "I’ve Done 1,500 Workouts. This One Thing Matters Most For Getting Jacked",
      "text": "I have ADHD and I used to get really overwhelmed from the amount of info out there. I became a perfectionist about what I see on the scale and would stop with my nutrition and fitnesss because I thought I couldn't be consistent enough. Channels like yours and getting help from my gym buds made me totally consistent the past 15 weeks. I keep things simple, track my workouts, and built an easy nutrition plan. The results are insane. Your videos really help guys like me man.",
      "author": "@brandonsaraniti771",
      "likes": 0
    },
    {
      "video_title": "I’ve Done 1,500 Workouts. This One Thing Matters Most For Getting Jacked",
      "text": "I think this is what I’m missing. I’m going to listen to ya. Track my workouts and progress with reps and added weight. \nSo every week should I just set a goal like 5 x10 of bench press for 95lbs ,then next week go for 100 lbs for 5x10 until that’s mastered. And so on. ? Or should I do 95lbs for 5x10 then add reps so 95lbs for 5x15 ? Then after that move on to more weight? \nSry that’s a lot but need help here.",
      "author": "@Jseppp",
      "likes": 0
    },
    {
      "video_title": "I’ve Done 1,500 Workouts. This One Thing Matters Most For Getting Jacked",
      "text": "I’ve noticed you often recommend progressing by matching reps across all sets (e.g. 6-6-6 → 7-7-7 → 8-8-8 within a 6–10 rep range), instead of always pushing for the top end and ending up with something like 10-9-8.\n\nCould you explain the main advantages of this approach in terms of fatigue management, rep quality, and long-term progression?",
      "author": "@marqsblg2274",
      "likes": 1
    },
    {
      "video_title": "I’ve Done 1,500 Workouts. This One Thing Matters Most For Getting Jacked",
      "text": "What does this mean in relation to exercise variation? On the big gym I go, I can do regular bench press, but also 3 kinds of machine press, and DB press... should I always do the exact same one? I'm old and sometimes feel like the safe, machine-ones could be best on a particular day...",
      "author": "@hugoschmitt1772",
      "likes": 0
    },
    {
      "video_title": "I’ve Done 1,500 Workouts. This One Thing Matters Most For Getting Jacked",
      "text": "Bro… love your content! You always cut to the chase with simplicity. 💪🙏 Btw how do you get that dark look on the videos? Is that a filter?",
      "author": "@banhazeropro",
      "likes": 0
    },
    {
      "video_title": "I’ve Done 1,500 Workouts. This One Thing Matters Most For Getting Jacked",
      "text": "Thank you for the content as always brotha! Snagged the course during Black Friday, absolutely loving it. Happy Holidays!",
      "author": "@justinmeasday3698",
      "likes": 0
    },
    {
      "video_title": "I’ve Done 1,500 Workouts. This One Thing Matters Most For Getting Jacked",
      "text": "been stuck in a rut, gonna try this out",
      "author": "@MioraMiora-d8s",
      "likes": 0
    },
    {
      "video_title": "Do This Warm-Up Before Every Workout",
      "text": "I think these videos are probably oriented more towards guys, but as a woman who's looking to get huge for my frame, I still get all the value out of them. I don't feel 'left out' or 'excluded', which is really rare in this space. Thanks for making your content, and please keep going!",
      "author": "@Suspicious-Mouse",
      "likes": 43
    },
    {
      "video_title": "Do This Warm-Up Before Every Workout",
      "text": "48 years of training and I do none of this -- except hang on a chin bar and light stretching of the pecs, shoulders and lats. I jump right in to my heaviest set. Then knock off 10% each subsequent set. Example: This morning I walked into the gym at 7:50 AM, hung from the chin bar for 30 seconds, did my pre-workout stretch, then went for my first set of seated cable rows: 210 lbs. for 7 reps, then 190 for 8 reps on the second set; 170 for 9 reps on the third set. Heavy to light gets your heaviest weight when the muscle is fresh, making the lighter poundages harder in the sets after. \n\nWalking on a treadmill or a stair stepper has never worked for me as a warm-up.  I do that separately, as well as stretch post-workout which includes band work. I get my mind ready in the shower and on the way to the gym. This works for me.\n\nAs Vince Gironda said, \"Your first set is your warmup set.\" There are no such things as \"warm up sets\", \"ramping sets\" or \"work sets\". That's gimmickry and \"bro science\". I hate that phrase.  EVERY SET YOU DO IS A WORK SET.",
      "author": "@firebird7479",
      "likes": 0
    },
    {
      "video_title": "Do This Warm-Up Before Every Workout",
      "text": "When I was a competing powerlifter I could spend up to 30 minutes just doing mobility. I do hit some mobility work now, specifically for the low back & hips but I do like 10 mins now & that's it. I genuinely think foam rolling is a waste of time. \n\nI do full mobility run throughs now on off days, 20mins-25mins are spot on. I'd suggest Tom Morrisons channel on here. But you cannot beat going through a full range of motion, with weight to improve your mobility. \n\nMost days I've been out walking for 45 mins or so before I lift, a walk really does \"get you moving\" \n\n🙏",
      "author": "@beans8130",
      "likes": 1
    },
    {
      "video_title": "Do This Warm-Up Before Every Workout",
      "text": "Man in all honesty, your point of view was very refreshing and it helped me alot with rescheduling my training routine. \nKeep being a Role model! Thank you 🤝💪",
      "author": "@Kevink4240",
      "likes": 14
    },
    {
      "video_title": "Do This Warm-Up Before Every Workout",
      "text": "Do you eat less on rest days than training days? I’m currently in the process of cleaning up my diet a bit since I dirty bulked from ~9%BF to ~15%BF. I find that I’m always mentally craving sweet things still tho like cereal on top of my yoghurt fruit bowl, peanut butter and jam, medjool dates, honey and bananas, etc.\n\nAlso if I’m lean bulking and don’t wanna track (and dinner is different each day), is a good approach to eat 3 massive meals a day and visually try to match across each day?",
      "author": "@deadly6978",
      "likes": 0
    },
    {
      "video_title": "Do This Warm-Up Before Every Workout",
      "text": "Hey I had a query, I have been following you for workout routine and you have been suggesting 4 workout a week routine. I wanted to know that how can I add cardio in all this, I add running in my routine so can it be that I lift 4 days and then in the rest 3 days, I give for running?? Does that become 6 days workout week?? My main problem is, If I don't get a good workout and get to move my body, I don't feel good. It opens up my brain and mood. So yes I can Incorporate 4 day lift per week, but what about the rest days? I'm interested in martial arts, Calisthenics and running....",
      "author": "@igniting...1308",
      "likes": 1
    },
    {
      "video_title": "Do This Warm-Up Before Every Workout",
      "text": "A simple 10-12 minute incline walk has worked for me for a while now. Just enough to get a tiny sweat going with a hoodie on.\n\nUsually 2 warm up sets of my main compound lift. Then we hit working sets. Always brace for impact with the 😯 face taking in a sharp breath of air and exhale at the end of the rep.\n\nForget everyone else is in the room. It’s you and the lift. Lock in and attack it",
      "author": "@A.C.E.",
      "likes": 1
    },
    {
      "video_title": "Do This Warm-Up Before Every Workout",
      "text": "That thumbnail bro!  Do a before and after pic from a year ago if you have same pose.  You put on some serious mass on biceps from like 6 months ago.  It may be small change in size but illusion/vascularity makes it look bigger.  Keep it up.   I have really reduced my screen time but when I get on YouTube it’s to catch up on your content.",
      "author": "@MD-fm8zx",
      "likes": 0
    },
    {
      "video_title": "Do This Warm-Up Before Every Workout",
      "text": "Well I already don't have enough time or patience for my usual workout so I just move weightless barbells to warm up, with a particular emphasis on shoulders because shoulders do tend to get injured quickly. You are absolutely right about body temperature though, cold is your worst enemy.",
      "author": "@Shalaska",
      "likes": 0
    },
    {
      "video_title": "Do This Warm-Up Before Every Workout",
      "text": "Walk for 5 min. that’s a warm up for ya!!",
      "author": "@JohnnyBushwhacker-yv6bc",
      "likes": 8
    },
    {
      "video_title": "Do This Warm-Up Before Every Workout",
      "text": "Thanks for the video. I was wondering if you could make a video about neck training and how to do that effectively. I've tried to use plates to do neck curls in the past but always felt like I couldn't progress and that my arms took over the movement instead of my neck.",
      "author": "@tsunami_art",
      "likes": 1
    },
    {
      "video_title": "Do This Warm-Up Before Every Workout",
      "text": "I'm going to try a slight mod on your split (legs-push-rest-legs-pull-rest-rest) for 4x/week for the next 6 months.  Usually jumping jacks for 2 minutes plus light band work and ramp sets for warmup.  Looking forward to getting in the new routine.  Longtime hardgainer.",
      "author": "@KingFinishCarpentryLLC",
      "likes": 0
    },
    {
      "video_title": "Do This Warm-Up Before Every Workout",
      "text": "Hey brother, I’m only getting 5-6 hours of sleep a night because I’m in the army deployed overseas and I lift 3 days a week and walk 15k steps a day eat clean and I’m shredding. But I’m worried about the sleep effecting me, is my 5-6 hours gonna stump me that bad?",
      "author": "@fnscar1716",
      "likes": 0
    },
    {
      "video_title": "Do This Warm-Up Before Every Workout",
      "text": "2 min treadmill jogg, 1 warm up set for first exercise with around 50 to 70% of my working weight for a few reps and straight onto the working sets. Simple.",
      "author": "@axelroccapt7183",
      "likes": 4
    },
    {
      "video_title": "Do This Warm-Up Before Every Workout",
      "text": "Hey brother can you do a video on how to calculate your max weight or working set if you're brand new and building your program?",
      "author": "@Mo-sk7xo",
      "likes": 0
    },
    {
      "video_title": "Do This Warm-Up Before Every Workout",
      "text": "5 min incline walk is already too much.. \n1. Shoulder mobility. \n2. Spine mobility.\n3. Hip, knees, ankle, neck, elbows mobility in 2-3 dynamic stretching \n4. 10 kicks , 10 side kicks, 10 punches 10-20 jumping jacks, 30 sec knee high jog .. that's it..",
      "author": "@A.Nick24",
      "likes": 0
    },
    {
      "video_title": "Do This Warm-Up Before Every Workout",
      "text": "Been trying your workout style for the past few weeks, have been really enjoying it! Question for you, is there anything you do on your rest days to promote recovery or wellbeing? Thanks",
      "author": "@nathanparish7122",
      "likes": 0
    },
    {
      "video_title": "Do This Warm-Up Before Every Workout",
      "text": "My 1 set to failure per muscle takes me around 2 minutes, so the first minute is my warm up.",
      "author": "@RickyRyan",
      "likes": 1
    },
    {
      "video_title": "Do This Warm-Up Before Every Workout",
      "text": "What about the stretching after a workout is it as important as a warm up? Also nice videos i watch them every time thank you",
      "author": "@tymusyoutube8986",
      "likes": 1
    },
    {
      "video_title": "Do This Warm-Up Before Every Workout",
      "text": "Hey Eric,love your stuff mate.\nWhat would you suggest is the best way to work out calorie maintenance?\nThanks bud",
      "author": "@shugthedug762",
      "likes": 0
    },
    {
      "video_title": "Do This Warm-Up Before Every Workout",
      "text": "Super weird question bro.. where do you get your joggers? 😅 Also really loving the content, always tuning in 💪🏻",
      "author": "@greccosantos1",
      "likes": 0
    },
    {
      "video_title": "Do This Warm-Up Before Every Workout",
      "text": "That's exactly what my PT told me to do. Get your body temperature up. It gets your joints lubricated. I did a 10 minute run starting with walking and slowly getting up to speed.",
      "author": "@JK13A",
      "likes": 0
    },
    {
      "video_title": "Do This Warm-Up Before Every Workout",
      "text": "With all the noise on the social media fitness industry, this is clear, concise, and to the point. Keep it simple, sweet, and effective. Great stuff man!",
      "author": "@arvis9223",
      "likes": 0
    },
    {
      "video_title": "Do This Warm-Up Before Every Workout",
      "text": "Good I'll check this tomorrow great video as always, I'll just switch the incline walk since I go to the gym in a bicycle and my gym has no threadmills",
      "author": "@alpujugo",
      "likes": 0
    },
    {
      "video_title": "Do This Warm-Up Before Every Workout",
      "text": "How long were your sessions when you ran an Upper/Lower split?",
      "author": "@kelvincarlos4632",
      "likes": 0
    },
    {
      "video_title": "Do This Warm-Up Before Every Workout",
      "text": "Btw, how do you manage to film in the gym while being an isolate the whole time?",
      "author": "@KryzysX",
      "likes": 0
    },
    {
      "video_title": "Do This Warm-Up Before Every Workout",
      "text": "Incredible work, Eric. Proud of you buddy. 100k is coming. An interesting video take that I'd love to see you cover is rest periods between sets. Various opinions out there.",
      "author": "@barbellbryce",
      "likes": 0
    },
    {
      "video_title": "The Hidden Rep Method That Got Me Jacked",
      "text": "this guy is a pure gem in fitness industry",
      "author": "@aniket4627",
      "likes": 47
    },
    {
      "video_title": "The Hidden Rep Method That Got Me Jacked",
      "text": "Physical therapist here. Keep up the good work! I can’t tell you how many patients I see have injuries from working out 6 days a week. As we get older, our bodies need the rest days and good sleep. Love the content!",
      "author": "@LeeDPT",
      "likes": 23
    },
    {
      "video_title": "The Hidden Rep Method That Got Me Jacked",
      "text": "Great advice. I'm currently doing single sets to failure, slow and steady, good range of motion, pausing for breath and poise, tracking my lifts, staying consistent. I'm getting more out of my workouts than ever before: making gains, staying injury-free, recovering quickly, feeling fitter, stronger and more energetic in life. I love the gym but you have to make it work for you, not the other way round - especially if you're older...",
      "author": "@joelonsdale",
      "likes": 1
    },
    {
      "video_title": "The Hidden Rep Method That Got Me Jacked",
      "text": "that gym is soo sick",
      "author": "@puffgod3",
      "likes": 15
    },
    {
      "video_title": "The Hidden Rep Method That Got Me Jacked",
      "text": "For older lifters, pausing at the top and bottom and going slow without any jerkiness and going to failure leads to maximum muscle growth and minimum chance of injury. Avoiding injury is paramount. I do just two sets for the main muscle groups but go maximum effort perfect form, every other day. It's plenty of effort.",
      "author": "@100toeface",
      "likes": 3
    },
    {
      "video_title": "The Hidden Rep Method That Got Me Jacked",
      "text": "Thanks for answering my question awhile back this is awesome.i get it now. by the way. Just to share my POV. Being able to recover more, people around me start noticing my physique. Back then I used to train like crazy for years. 5-6 days a week. All it did was, sometime ago lifting with em boys, most of the time injuries, and really really dead fatigue to a point I cant think straight due to severe lack of focus. Yes I did somehow reach my goals but at what risk. What you said its absolutely true. Recovery is dead important. Now I focus on that.",
      "author": "@hamsterdamdam",
      "likes": 0
    },
    {
      "video_title": "The Hidden Rep Method That Got Me Jacked",
      "text": "What’s funny is that the “weeds” as you call it is what got me into lifting. I love nerdy, nitty, gritty number stuff so I researched and researched all this hyperspetfic cues and exercise selection and after 6 months I was like why don’t I try it out and loved it. But I wouldn’t recommend most people do it. When someone asks my I simply and express that commitment and consistency are the key 80% to 90% of what works",
      "author": "@hansdykstra3869",
      "likes": 0
    },
    {
      "video_title": "The Hidden Rep Method That Got Me Jacked",
      "text": "Does a person need to do forced reps, like do 2 more reps, than you could  naturally do, with a spotter, on  the last 2 sets after getting  warmed up?  That is the way I was taught, and the way everyone trained in the 80's and 90's.  Is that the best way or not?",
      "author": "@michaelcraig9449",
      "likes": 2
    },
    {
      "video_title": "The Hidden Rep Method That Got Me Jacked",
      "text": "thank you after watching your video about protein I didn't buy Whey protein and sticked to getting it from my diet\nbut what about Creatine? I'm a complete 25 years old beginner so do you think it would help ?",
      "author": "@bo34-y4e",
      "likes": 0
    },
    {
      "video_title": "The Hidden Rep Method That Got Me Jacked",
      "text": "Thats how i do it aswell. I appreciate that you have time to mentally prepare for the next rep, especially the closer you get to failure. Its like mustering up all your strenght and focus for the next rep coming.",
      "author": "@matthiasryser6305",
      "likes": 0
    },
    {
      "video_title": "The Hidden Rep Method That Got Me Jacked",
      "text": "Nah... you gotta throw the weights down, yell like you're trying to shit out a housebrick, then leave all the 'bells & plates scattered around the gym floor. Don't forget to leave all the machines loaded just so everyone knows how heavy you lifted. Finally, make sure to leave your empty tren vials in the locker room - your mom will come along soon to tidy up after you like she always does...",
      "author": "@neilwheel",
      "likes": 0
    },
    {
      "video_title": "The Hidden Rep Method That Got Me Jacked",
      "text": "I started training 3 years back. I used to get into my head about grips, negatives, pauses etc. I realised that it's all about you enjoying the process. Train hard, sweat hard, eat hard, sleep hard ! That's it!!!",
      "author": "@Gym-and-Jesus",
      "likes": 1
    },
    {
      "video_title": "The Hidden Rep Method That Got Me Jacked",
      "text": "I feel the weights much better in the target muscle when I pause. I love it. Lower a little slower controlled, pause and think about using the muscle then boom. Repeat. All the science and studies stuff has really detached me from watching weight lifting content on YT now. I’m very grateful for it as well. Do what feels right to you, have fun, push yourself and rest.",
      "author": "@MTheory333",
      "likes": 0
    },
    {
      "video_title": "The Hidden Rep Method That Got Me Jacked",
      "text": "Yep, basics programs like 20-30 year's ago for couple years and you will be good. But that doesn't sell on yt and insta",
      "author": "@emate8422",
      "likes": 1
    },
    {
      "video_title": "The Hidden Rep Method That Got Me Jacked",
      "text": "I find Paused Reps effective, easy and difficult all at the same time. I do a lot of my exercises with a not so deliberate paused rep. It just happens naturally to me as I always prefer a slow and controlled negative pretty much on everything. And adding a split second pause helps that cause.",
      "author": "@rishabhbose29",
      "likes": 0
    },
    {
      "video_title": "The Hidden Rep Method That Got Me Jacked",
      "text": "If you do this I think you would have to make sure to repeatedly reconnect with the muscle during every pause rest on each rep. So repeated mind to muscle connection will need to be recreated for each rep.",
      "author": "@balla2828",
      "likes": 1
    },
    {
      "video_title": "The Hidden Rep Method That Got Me Jacked",
      "text": "That T Bar machine looks too official, I’ve never seen one like the one you showed. It’s hard to find gyms that have any T Bar setups. I grew the most back muscles from the T Bar. It just works for me.",
      "author": "@micaheldey1981",
      "likes": 0
    },
    {
      "video_title": "The Hidden Rep Method That Got Me Jacked",
      "text": "Number one rule....have fun and lift the way you enjoy. Just be smart and don't hurt yourself",
      "author": "@austinrandall1273",
      "likes": 0
    },
    {
      "video_title": "The Hidden Rep Method That Got Me Jacked",
      "text": "Hey, just wanted to let you know I sent you an email with a short edited sample using a fragment of your film. It’s only about a minute long, so it’s quick to watch. I’d love to hear what you think when you get a moment.",
      "author": "@Barteqq11",
      "likes": 0
    },
    {
      "video_title": "The Hidden Rep Method That Got Me Jacked",
      "text": "Another winner!  Very impressive calves. Question. Do you still do 3 sets of 8 to 12 reps even with calf raises and forearm exercises?",
      "author": "@domjohndemarco",
      "likes": 0
    },
    {
      "video_title": "The Hidden Rep Method That Got Me Jacked",
      "text": "Also, many American adults barely move, like sloths. So, if you go for walks, and touch weights, or do anything physical, then you're already doing something.",
      "author": "@maxmeeks9910",
      "likes": 0
    },
    {
      "video_title": "The Hidden Rep Method That Got Me Jacked",
      "text": "Gym coach for employed casuals. Refreshing. Different from the ranked unemployed gym rats",
      "author": "@TheJan",
      "likes": 0
    },
    {
      "video_title": "The Hidden Rep Method That Got Me Jacked",
      "text": "Thats Mentzerizm with a twist, and i like it. Its just that simple guys, no need to overcomplicate simple things :) Shock the body > let it rest > let it grow > repeat.",
      "author": "@greypant7204",
      "likes": 0
    },
    {
      "video_title": "The Hidden Rep Method That Got Me Jacked",
      "text": "Thank you, Eric, for the simplification of my weight training routine.  \nI can have my life back.\nI am forever grateful.",
      "author": "@gregoryowen841",
      "likes": 1
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "Finally someone said it. \n\nI was intermittent fasting, only getting two meals a day, lost 20lbs, def under ate my protein and my numbers in the gym kept soaring higher and higher. It’s all a gimmick",
      "author": "@donnylem8818",
      "likes": 23
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "Those recommendations are atypical (2g per kg is just the \"safe number\", not the recommended minimum. The usual range is 1.2-1.6...) and companies selling protein pudding really aren't part of the fitness industry, they're just commerce being commerce. They're selling you vegan water as well but nobody sane is gonna pretend like they're part of some vegan movement. Listening to nutritionists giving you average numbers for the general population is also wrong because they're giving you numbers for sustaining a healthy life with some light to moderate fitness like 2 runs a week.\n\nYes, the industry is wrong for most people because it takes a ceiling for the 5% and pretends like every average lifter needs to go there. But there's no need to reach like that. Throwing the pendulum the other way helps no one.",
      "author": "@Hosenanzugtasche",
      "likes": 0
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "When i was 17 i gained 10kg of bodyweight and developed my body the way it is today. Only eating 95% carbs and training hard as f*ck. when i was walking back home, i used to stop at a dunking donuts store and buy a box of  six donuts and walk back home eating it. When i got home, used to eat 6 french breads with butter and jelly and drink a liter of milk, was never a great protein eater, used to eat one chicken beef ta lunch. Now i'm 48 and have 85kg, 43kg of muscle and around 12-15% of boddy fat. All because of what i built in that time. And i'm still eating loads of carbs, and the bare minimum of protein. The training is mixed, tomorrow, a 5k run targeted at a 27' mark, low to high.",
      "author": "@rudolph3058",
      "likes": 2
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "I believe, in my opinion, it's the amount your body can absorb and utilize for maintenance and repair at a given time- just enough to avoid catabolism and maintain anabolism. I used to injest liquid amino acids combined with a mineral supplement of calcium and magnesium with yogurt an hour before training.  Avoided long digestion times and worked quickly in increasing my lifting strength. Any amount over is either stored or depleted....and there are still some medical professionals claiming the controversial opinion that high animal protein damages kidneys. Carbs are very important for the energy required for lifting and for filling out your muscles. Notice how huge your muscles look the day after you lift. Carbs retain water-muscles mostly water.",
      "author": "@johnstelluto9101",
      "likes": 0
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "it takes 2.5 grams of leucine to trigger the mtor switch ( anabolism ) along with the other 9 essential aminos which basically means eating about 25 to 40 grams of complete protein depending on the source, once mtor is activated it will take a minimum of 3 hours before you can flip that switch again, so 3 to 4 meals with 30 grams of protein in each over the course of 9 to 12 hours is the best you can really do, breakfast, lunch, dinner, with a complete protein source and enough overall calories to support training hard and recovery is the best you can do, it's just normal eating but focusing on getting protein in each meal",
      "author": "@terrytibbs1040",
      "likes": 1
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "Enjoyed the talk. You did say though that at 185lbs you have about 140g of protein. That is still a lot. To seek out meals that would total 140g of protein per 24hrs is still being very \"protein thinking\". So I don't really get what the big lie is? It's already extremely well established that we need protein to repair and grow muscle...and you seek out 140g per day. I think if you are saying that you don't need the sometimes suggested 1g per 1b of bodyweight and that 0.6g to 0.8g per lb is sufficient, then yes that's fine. It's not exactly the \"Biggest lie in the Fitness Industry\" though...",
      "author": "@DuncanWalshWorkoutPlans",
      "likes": 0
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "0:51 I find it baffling, how could someone critique your form? Full range of motion, dead stop at start of each rep and each set close to or to failure, arent all of these what the \"science bros\" been preaching for years?😅 These ppl are either straightup tarded or they were trying to bully because you just started your channel.",
      "author": "@fourtii8707",
      "likes": 0
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "Those medical studies also show that the higher end, the .8 grams per pound, is pretty much only for professional level lifters. Your average gym goer doesn't need that much either.",
      "author": "@Jushtan-g3y",
      "likes": 10
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "Hey bro question when doing the lat pulldown, do you feel your biceps too? All my back and biceps sessions, every time I finish the 3 back exercises; when I get to my 3 bicep exercises, they are already fatigued and have a pump already which leads to well yeah lesser of a workout for them. I still train them to failure but I just don't know how to not get them fatigued. Do you get that too?",
      "author": "@TradingWithSergueev",
      "likes": 0
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "im doing 400g of chicken brest on grill + 6eggs boiled + 100g of mozzarela melted on the chicken + 80g of bacon, i dont use seedoils to cook. ONE MEAL A DAY , at 17:00-18:00 after workout . Thats 1800kcal , 212g protein 99g fats 4g of carbs. got jaked, shredded, my testosterone skyrocketed, i feel amazing, been eathing like this for years ( i dont care about taste and diversity ) im 6foot6 and 185 pounds 35 years old. ALSO NEVER EVER HAVE I GOTTEN SO MUCH ATTENTION FROM THE LADIES IN MY LIFE AS I DO NOW!",
      "author": "@DanDan-vl9dd",
      "likes": 0
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "Wow! So many lives wasted due to insecurity. Getting \"jacked\" fixes nothing. All \"jacked\" guys have tiny pee pees before and after lifting weights and women know this. All muscle men might as well wear a shirt that says \"I HAVE A MICRO\"!!! Everybody knows.",
      "author": "@Geardrive427-ip8vj",
      "likes": 0
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "I’ve recently found this out through my own experience. I’ve always had a mass mindset. I carry about 235-240lbs on a 5’10” frame on a bulk reaching about 20% body fat taking in about 200-220gr protein daily. While on a cut at the moment I’m down to about 195lbs and taking in about 140-150gr of protein and have been amazed at the muscle retention over the last 2 months. I plan to go to about 180lbs. Solid information my friend that I can attest to myself.",
      "author": "@sgtsclark1",
      "likes": 0
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "Hello look up \" Channel 4  joe wicks Killer bar . You can watch it on line . It is all about what is put into food and that goes for the US , The best advise is make your own food from source . Example  spaghetti bolognese , Just the basic ingredients , tomato puree  . Avoid anything with diet as more harmful ingredients , farm markets , I know eggs are expensive in the US . Trying looking farms near by . But what the programme on Killer .",
      "author": "@guyagnew",
      "likes": 0
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "OK  we can do the math, to figure this out, But how do you know how much actual protein you are getting in  stuff you eat, to  know how much you are getting?  Do you get a gram scale and put stuff on it, like turkey, beef, or whatever, like that, each day?",
      "author": "@michaelcraig9449",
      "likes": 1
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "one of the biggest lies is how much protein the fitness influencers tells you how much you need... i can LITERALLY get 80-120g and i get insane development, and it wont see a difference if i instead over 6 month took 190g, what REALLY matters is if your body feels sore even though you train alot, its probably because your muscles are not getting enough protein to repair it self fast enough",
      "author": "@MikkiZHskDK",
      "likes": 1
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "I have been thinking this for a long long time. The push for 1 gram to 1+ grams of protein per lb of body w8 is extremely hard to achieve and still eat other essential foods; and so, \"you have to spend lots of $$ on protein powders\".  And when I was in my 20s, I had the best body eating adequate protein and more carbs relatively - like what Mike Mentzer said. Thanks!!",
      "author": "@jamesk8s1",
      "likes": 0
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "True. I was stating this a long time ago and i am happy that more and more people find out about the protein lie. As a 96 kg long time lifter, i could mantain and grow in size and strength with around 100 grans of protein per day (give or take). It is the total calories, not the protein. Train hard, sleep well, be disciplined and consistent and stop obsessing over protein",
      "author": "@florinpieleanu130",
      "likes": 0
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "In the food industry it is all advertisement shit indeed. I once analysed a \"protein bar\", finding out that 90% of its ingredients turn out to be sugars and general carbohydrates in any kind of variable that seems to be available to stuff into one bar - just to have it look like it is not one piece of sugar. ABSURD!",
      "author": "@muralist_",
      "likes": 1
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "I agree 100%, in my opinion 0.7g of protein per pound of lean body weight is more than enough. If you weigh 190 lb at 15% body fat which is rougjly 30 lb of fat and considering you have about 10 lb of bone mass you are looking at only requiring 105g of protein daily. Which is insanely easy to hit.",
      "author": "@online9161",
      "likes": 0
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "while I respect your points. I personally checked my blood and went to a specialized dietiatian(for my hypothyroidism) and I have pretty low muscle mass and low protein levels. she really stressed I make sure I'm eating enough protein in my diet to build muscle.",
      "author": "@bayanbishara6666",
      "likes": 0
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "140g of protein a day is still a lot more than someone who isn't paying attention to protein would eat though?\nNo way my wife for example tops 60-80g of protein a day.",
      "author": "@THFourteen",
      "likes": 0
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "Obsessing over protein is also just bad for cutting. You end up drinking extra calories and consuming protein bars which are basically candy, instead of just eating real whole foods.",
      "author": "@Timo1o1",
      "likes": 1
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "175lbs 15% and I eat 60g a day, I found if you eat fruit instead of cooked protein it effectively replaces that protein from cooked foods. I eat one cooked meal a day and over 1k kcals of fruit. Went from 155lb to 175lb same bodyfat",
      "author": "@Frodoswaggns",
      "likes": 0
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "It matters big time once you reach 50 and older though. If by then you happen to also have H. Pylori or any condition that causes low stomach acid, high protein becomes mandatory for any hope of getting/being/staying lean and jacked.",
      "author": "@kittendkat5100",
      "likes": 0
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "Contradict the whole point of the video at 3.23, you're one of them",
      "author": "@TonyMontana-zl8pz",
      "likes": 2
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "Man you have so much defination 🔥🔥, what's your body fat percentage??",
      "author": "@Sushi_nath",
      "likes": 0
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "Why are gorillas massively strong with huge muscles...Where do they get their protein?",
      "author": "@notabiologist9865",
      "likes": 0
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "Good video. Even 0.4-0.5 grams of protein per pound of body weight can work fine as long as you're eating enough carbs and implement progressive overload",
      "author": "@itamaravraham4068",
      "likes": 0
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "The biggest lie in the fitness industry is roiheadslike you juicing while preaching about eating avocado",
      "author": "@ROSSLORD-k8r",
      "likes": 1
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "There is a big difference between 1g of protein for every pound of body weight and 0.6-0.8 grams of protein for every lbs of body weight and the difference could be a whole steak or two per day",
      "author": "@anon5863",
      "likes": 0
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "Biggest lie in the fitness industry is the amount of PEDs.. the one gram per pound is during a cut. Carbs and fat are \"protein sparring\" if you haven't heard that you're not dealing with an \"expert\".",
      "author": "@bdono555",
      "likes": 0
    },
    {
      "video_title": "The Biggest Lie In The Fitness Industry",
      "text": "Protein bars. Another fitness scam. 😂",
      "author": "@MateuszRusinek-nc1up",
      "likes": 3
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "I nowadays do 2 full body workouts a week. And I feel like this is working better for me than 3 days of ppl. I can hit full body twice and get away without over training. 💪🏻",
      "author": "@fahiim_x",
      "likes": 55
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "This is how I train lately too, and it's been excellent.\n\nBasically at some point I realized that the only way to balance high intensity progressive overload with adequate recovery was to manage my volume. I started focusing on quality of sets rather than quantity, and everything came together.\n\nLove your channel - nothing too flashy or gimmicky, just straight to the point, sensible, and clear. I think lot of people really need to hear this.",
      "author": "@takewithfood",
      "likes": 6
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "I do a full body 2-3 days per week. Still have my six pack",
      "author": "@dr.kurtjohnson1791",
      "likes": 13
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "I have been training three times a week for months using a push/pull/full body system (Sat, Sun, Wed). For each session and each muscle, I only do 3-4 hard sets to failure, followed by 2 pump sets fpr each muscle with 20-30 reps and light weights (similar to the FST-7 concept). Even after many years of doing this, I am still making good progress.",
      "author": "@jensb661",
      "likes": 0
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "Just watched your last 3 vids. Man I've been looking for you. I've put off going to the gym for years because I can't afford a trainer and just dunno what the hell to do. I'm going to get your course and change my life now thanks brother!",
      "author": "@Nicholasoswalt117",
      "likes": 1
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "Thank you so much for such a detailed explanation!\nI have a question,I remember in one of your old videos about your U/L routine,you said 2 shoulder exercises,Laterl raises and rear delt fly.Can the rear delt fly be completely excluded ?\nMy concerns stems from the fact that having heavy bench press movement needs an opposing some sort of scapular retraction exercise for shoulder health.\n\nThanks",
      "author": "@umairahmed9582",
      "likes": 0
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "I thought that when u said aim for progressive overload is that when u get 6 reps on the three sets, that in the next session, so next week,  u have to aim for 7 reps on all three sets to acheive progressive overload. So what u're saying in this video it's not needed on all three sets, just the first set aim for 7 reps, and then the other two sets can stay on 6?",
      "author": "@TradingWithSergueev",
      "likes": 0
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "Minimalist. I like it",
      "author": "@SanfordRolleJr",
      "likes": 9
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "Hi! Why do 2-3 sets per exercise? Didn't you previously recommend doing one set to failure for each exercise?",
      "author": "@velsmakende2518",
      "likes": 0
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "Great channel! So are you doing 3 sets still? or 1-2 sets to failure?",
      "author": "@musicbox4022",
      "likes": 1
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "Brother, thank you. Today marks 12 weeks of my routine, and from the advice and explanations you gave in a previous video, I’m never exhausted when it’s time to grind (went from 6 days a week to 3 days in the gym) I feel better physically, and I’m seeing great improvement with consistency and adding weight to build my strength. You’re a stud, keep this up. Time for the next 12 week routine!",
      "author": "@spencernay9528",
      "likes": 0
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "Do you feel like you look much wider in clothes than when you started? I have such a narrow frame that I’m worried no matter how much muscle I put on, I’ll still always look like a small person due to my frame",
      "author": "@therazorscooterkings",
      "likes": 1
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "Hey Eric,\nIn the paid routine you say accessories rep range is 10-15 and when you hit 15 on all increase the weight. But here you say you usually do 8-12. Which is it?\nThanks,\nMike",
      "author": "@Mikeebee24",
      "likes": 0
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "I lift once every 4 days. Biceps / triceps / shoulders - 3 days off - chest / back / legs. 3 days off - repeat. MASSIVE GAINS! I only eat carbs after my lifting sessions. never looked or felt better in my life. 44 years old.",
      "author": "@rs-vl2im",
      "likes": 0
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "I normally do PPL haven’t tried upper lower yet\n\nWould I train Back arms shoulders and Chest in the same day then ?",
      "author": "@Eman-sc1gw",
      "likes": 0
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "How many days of rest should i take between each workout, i mostly go close to failure on compounds and on isolation i go beyond failure with partials .",
      "author": "@GrimMortal123",
      "likes": 0
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "I’ve been following your upper/lower 4 days a week routine and I swear I’ve noticed more muscle growth in the last month than I have since the start of the year when I started going to the gym doing a bro split 5/6 days a week.\nThank you 🙏",
      "author": "@Dale_D589",
      "likes": 0
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "PPL\n\nPush\nRest\nLegs\nRest\nPull\nRest\nRepeat\n\nBest gains iv ever had.",
      "author": "@whydoyouneedmyname6508",
      "likes": 5
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "I just turned 40.  I haven't missed a day in the gym since 2021, but its calculated.  Alternate push/pull/legs and mix in a few cardio days and a few days where I just go to Life Time and hit the hot tub, steam, sauna, cold plunge.  It's a solid balance for me.",
      "author": "@weekendatburnsys7006",
      "likes": 1
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "currently i m following 4 days upper lower with 2 sets each exercise and its amazing recovery is amazing i don't feel fatigued i recover faster and on the remaning 2 days i just do hiit sessions and it helps me to recover faster between sets specially on leg days",
      "author": "@kong6355",
      "likes": 0
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "I don't think hitting 4-5 days gym is a problem. the real problem is ppl don't train at all, not following a right diet, techniques and inconsistency. and in most of your videos you telling to train less and less.  🤷",
      "author": "@sahan6996",
      "likes": 0
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "Am i the only one who can not see difference between slpit 3 tiems a week vs pus, pull, legs 3 tims a week?",
      "author": "@konrad1479",
      "likes": 0
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "i have ample of time and i like going to the gy, 6 times a week . what split  i shuld do ? i am doing ppl right now",
      "author": "@berlin5403",
      "likes": 0
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "So is that actually you in the photo or is that a fitness model? It's always a voice over while that guy works out",
      "author": "@kens1335",
      "likes": 0
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "what are you thought of cardio on off days? great vids.",
      "author": "@ERICFOSTER-fb8io",
      "likes": 1
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "Do you always rack the weight in between reps when using machines? Cheers",
      "author": "@golfaddict86",
      "likes": 0
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "1hr full body 3x a week.  some form of cardio or activity 2x. Works great for me. Doesn’t become a grind or boring",
      "author": "@Yozzer72",
      "likes": 1
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "Doing 2 day split, 1 rest day. Chest and biceps plus shoulder lateral raises and legs squats, Back and triceps, shoulder presses and another squat variation.",
      "author": "@paulphiliptolentino9962",
      "likes": 0
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "Great video man. How can I contact you for a question/business inquiry?",
      "author": "@Barteqq11",
      "likes": 0
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "I thought you were advocating 1-2 sets? Mentzer Style",
      "author": "@bomzbero",
      "likes": 0
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "But can you show a whole training plan for this? Like which Exercices for each musclegroup?",
      "author": "@mitzukirigaya3180",
      "likes": 0
    },
    {
      "video_title": "The Best Workout Routine If You Don’t Want To Live In The Gym",
      "text": "Love the videos bro! What camera do you use for filming? God Bless",
      "author": "@Lucas.33.",
      "likes": 0
    },
    {
      "video_title": "Unfortunately, Fitness Really Is This Simple",
      "text": "Great stuff, man. I’ve been following this same routine 3–4 times a week for the past six years, while keeping my diet and sleep consistent, and I couldn’t agree more with what you’re saying. Over time, you really start to see how powerful the basics are. It’s not about chasing new programs or doing anything extreme—it’s about mastering the fundamentals and sticking with them. Some weeks the progress is obvious, other weeks it’s subtle, but it’s always adding up in the background. That long-term consistency builds not just physical results, but discipline and confidence too. Six years in, it’s clear that showing up regularly and trusting the process beats any short-term motivation. Consistency really is the key! 🦾",
      "author": "@alexsoccer899",
      "likes": 0
    },
    {
      "video_title": "Unfortunately, Fitness Really Is This Simple",
      "text": "In Australia its summer, Ive neen full of big gym energy since spring, workouts are next level! \n\nWinters get heaps cold where I am and daylight hours drop down. I still gym consistently, no issues there, but I'm definitely slower and miss that backup determination. How do you keep your mental state up in winter?  \n\nFyi this year I accepted it as slower/ form focussed recuperation time and I count down the days. I had a much easier winter and I came back swinging in Spring!",
      "author": "@Aiden214",
      "likes": 0
    },
    {
      "video_title": "Unfortunately, Fitness Really Is This Simple",
      "text": "Its just time consuming. Even actors who get into peak shape within 6 months eat 4-5k calories a day with so much of it being protein and then the intense workouts. People want instant results rather than long term progress. I do get it though. I went from bodyweight dips to adding 45 lbs for 8 reps a year later and I didnt look any bigger but I clearly was stronger. It's part of the reason I quit the gym for a while. Between the cost, the weather and just not seeing the physical mass development I wanted I was less inclined to keep going to the gym.",
      "author": "@teartrapz2897",
      "likes": 0
    },
    {
      "video_title": "Unfortunately, Fitness Really Is This Simple",
      "text": "Advocating for people to walk 10 fucking thousand steps a day is ridiculous and instantly made me stop the video. Shit will take several hours to do (minimum 2 if you're walking normally and are able to do so), something normal people with jobs do not have the time or energy for. Low effort my ass. \nNot to mention you're saying we don't need to spend 2 hours in the gym to get results, then pivot to spending 2 hours walking. Fantastic.",
      "author": "@Jimmykreedz",
      "likes": 1
    },
    {
      "video_title": "Unfortunately, Fitness Really Is This Simple",
      "text": "Love the \"sunlight asap\" message.  UV light turns on so much in the brain and the lack of UV light turns so much off.  We are meant to be awake during the day and sleep at night.  Just think of the last time you had a power outage for a couple of days and went \"It's dark and I'm bored... I guess I will go to sleep.\"  What time did you wake up in the morning?  I got money on dawn and would double down on the feeling of wanting to get the day started.",
      "author": "@LetsPlaywithDDae",
      "likes": 1
    },
    {
      "video_title": "Unfortunately, Fitness Really Is This Simple",
      "text": "Agree.  \nIm 42 now,  im i ve been training 5x a week for years,  and i dont see that much progress.\nI train well... Push pull leg with weight progression... doing everything slow and focused,   most of the time try to eat well... But i feel that im not getting better.  \n\nFrom January 2,  i will start a 3x full body training with heavy weight and low reps,   keep with 200gr of protein a day,  and including 3 or 4 days of 10k steps",
      "author": "@psychoGamesStudios",
      "likes": 0
    },
    {
      "video_title": "Unfortunately, Fitness Really Is This Simple",
      "text": "I actually found out that consistency is the key and to be consistent you have to have fun. If you don’t have fun while at the gym then you don’t need to go there and you do it just because of the hype around fitness. I personally found out that I have fun when running and hiking and that’s all I’m doing, and also some body weight exercises that I like. Pumping iron was not for me even though I have good genetics. It’s probably weird to see a big guy with wide shoulders like me to run a lot but it’s so fun for me that I can’t help it lol",
      "author": "@yuru25",
      "likes": 0
    },
    {
      "video_title": "Unfortunately, Fitness Really Is This Simple",
      "text": "Honestly ya. The David Goggins of the world and all the weight lifters and body builders that push the message they do, have had just as much of a negative impact as sedentary lifestyle. Cuz all the “supermen” telling people to try to be them is the reason few people manage. You’ll learn more going to the gym and talking to the old guy in average shape who’s been there for a while, rather than any muscle monster you see on the internet.",
      "author": "@quintonb9626",
      "likes": 1
    },
    {
      "video_title": "Unfortunately, Fitness Really Is This Simple",
      "text": "i get 15-20K steps everyday when i cut on top of my weightlifting, but when im bulking, why would i walk? ill need to eat even more, i literally can't, im stuffed",
      "author": "@endorfiene7457",
      "likes": 0
    },
    {
      "video_title": "Unfortunately, Fitness Really Is This Simple",
      "text": "Ok, but what if no gym or too lazy to go to gym?\n(The answer is just do the exercises that one is able to without a gym. Yes, it's also that simple. Basically, u don't need a gym to exercise. I should do so myself, but just don't outta pure lazyness, ngl. 🙃)",
      "author": "@luislebronaponte2737",
      "likes": 0
    },
    {
      "video_title": "Unfortunately, Fitness Really Is This Simple",
      "text": "For experts out there reading this, is this the best advice to follow to make sure I’m staying on track? If you could rate this video from 1-10, 10 being the best advice, please HIT ‘LIKE’ on my comment. Thank you.",
      "author": "@peacelovejoyandhappiness",
      "likes": 0
    },
    {
      "video_title": "Unfortunately, Fitness Really Is This Simple",
      "text": "I have a fitness plan for YouTube viewers.  Select a topic.   Mine is Months.  Any time someone says a month name during their video, I do 10 pushups.",
      "author": "@FreedomI775",
      "likes": 0
    },
    {
      "video_title": "Unfortunately, Fitness Really Is This Simple",
      "text": "It's simple until you herniate a disc and there is no more fitness in your life. Since I herniated a disc I've been eating and sleeping for two years, waiting to heal.",
      "author": "@bobs-ox6xo",
      "likes": 0
    },
    {
      "video_title": "Unfortunately, Fitness Really Is This Simple",
      "text": "Back in April I had a dehydration episode that freaked me (and my family) out. In May I twisted an ankle in my 50th birthday, so I stopped working out altogether and now I'm in my all time max weight. 2025 is about to end now and this video completed my motivation. Thanks from CDMX.",
      "author": "@bernardoaguilargt3763",
      "likes": 0
    },
    {
      "video_title": "Unfortunately, Fitness Really Is This Simple",
      "text": "What you said is exactly what chatgpt said, you can have a toned body in 12 weeks just by what you and chatgpt said however it is toned and healthy not jacked like your body. Just fyi or just making sure people have realistic expectation.",
      "author": "@Dryrain-d9h",
      "likes": 1
    },
    {
      "video_title": "Unfortunately, Fitness Really Is This Simple",
      "text": "That gym is awesome; mine just upgraded after 15 years. I know it's my fault for not spending a high amount on a gym membership, but those North American gyms are top-notch.",
      "author": "@KaiserKross777",
      "likes": 0
    },
    {
      "video_title": "Unfortunately, Fitness Really Is This Simple",
      "text": "Can i get a one week free sample? I just wanna double check if this is my programma for 2026..",
      "author": "@Buddydegroot",
      "likes": 0
    },
    {
      "video_title": "Unfortunately, Fitness Really Is This Simple",
      "text": "I just bro split 4-5 times a week 40 minutes to an hour in the gym. I’ve made great gains doing that",
      "author": "@Noname-6py",
      "likes": 0
    },
    {
      "video_title": "Unfortunately, Fitness Really Is This Simple",
      "text": "It is boring. Boring is good. I'm doing it for 5 or 6 month now, and I already dropped 18 kg, gained muscle and is able to perform 7 pull-ups x 4 sets like nothing. Just stay in it.",
      "author": "@necronlord52",
      "likes": 1
    },
    {
      "video_title": "Unfortunately, Fitness Really Is This Simple",
      "text": "...\"cut your body weight in half, that gives you the correct amount of ounces\"...\nAmericans, when they use \"standards\" nobody else does. 😀",
      "author": "@Zett76",
      "likes": 1
    },
    {
      "video_title": "Unfortunately, Fitness Really Is This Simple",
      "text": "So what about sunlight for those of us who work overnight shifts?",
      "author": "@Millennial_Republic",
      "likes": 0
    },
    {
      "video_title": "Unfortunately, Fitness Really Is This Simple",
      "text": "Yup. Progressive overload. Managing fatique to prevent injuries. Joint is tendon, most injuries are tendon injuries and they take forever to recover. Rest.",
      "author": "@BomoBomo-go6wt",
      "likes": 0
    },
    {
      "video_title": "Unfortunately, Fitness Really Is This Simple",
      "text": "I know that walking is great, but if you are not working as a postman or something similar, 10 000 daily steps is simply not realistic!! It will easily carve out at least 90 min of my day!",
      "author": "@0xBADABA55",
      "likes": 0
    }
  ]
}